Repository: humblefoundation-zz/translation-support-files
Catalog: quran-imported/Muhsin Khan.tmx
Source language: ar
Languages: en

source: ولقد استهزئ برسل من قبلك فأمليت للذين كفروا ثم أخذتهم فكيف كان عقاب
en: And indeed (many) Messengers were mocked at before you (O Muhammad صلى الله عليه و سلم), but I granted respite to those who disbelieved, and finally I punished them. Then how (terrible) was My punishment!

source: أفمن هو قائم على كل نفس بما كسبت وجعلوا لله شركاء قل سموهم أم تنبئونه بما لا يعلم في الأرض أم بظاهر من القول بل زين للذين كفروا مكرهم وصدوا عن السبيل ومن يضلل الله فما له من هاد
en: Is then He (Allah) Who takes charge (guards, maintains, provides) of every person and knows all that he has earned (like any other deities who know nothing)? Yet, they ascribe partners to Allah. Say: "Name them! Is it that you will inform Him of something He knows not in the earth or is it (just) a show of false words." Nay! To those who disbelieved, their plotting is made fairseeming, and they have been hindered from the Right Path; and whom Allah sends astray, for him there is no guide.

source: لهم عذاب في الحياة الدنيا ولعذاب الآخرة أشق وما لهم من الله من واق
en: For them is a torment in the life of this world, and certainly, harder is the torment of the Hereafter. And they have no Waq (defender or protector) against Allah.

source: مثل الجنة التي وعد المتقون تجري من تحتها الأنهار أكلها دائم وظلها تلك عقبى الذين اتقوا وعقبى الكافرين النار
en: The description of the Paradise which the Muttaqun (the pious - See V.2:2) have been promised: Underneath it rivers flow, its provision is eternal and so is its shade; this is the end (final destination) of the Muttaqun (the pious - See V.2:2), and the end (final destination) of the disbelievers is Fire. (See Verse 47:15)

source: والذين آتيناهم الكتاب يفرحون بما أنزل إليك ومن الأحزاب من ينكر بعضه قل إنما أمرت أن أعبد الله ولا أشرك به إليه أدعو وإليه مآب
en: Those to whom We have given the Book (such as 'Abdullah bin Salam and other Jews who embraced Islam), rejoice at what has been revealed unto you (i.e. the Qur'an), but there are among the Confederates (from the Jews and pagans) those who reject a part thereof. Say (O Muhammad صلى الله عليه و سلم): "I am commanded only to worship Allah (Alone) and not to join partners with Him. To Him (Alone) I call and to Him is my return."

source: وكذلك أنزلناه حكما عربيا ولئن اتبعت أهواءهم بعدما جاءك من العلم ما لك من الله من ولي ولا واق
en: And thus have We sent it (the Qur'an) down to be a judgement of authority in Arabic. Were you (O Muhammad صلى الله عليه و سلم) to follow their (vain) desires after the knowledge which has come to you, then you will not have any Wali (protector) or Waq (defender) against Allah.

source: ولقد أرسلنا رسلا من قبلك وجعلنا لهم أزواجا وذرية وما كان لرسول أن يأتي بآية إلا بإذن الله لكل أجل كتاب
en: And indeed We sent Messengers before you (O Muhammad صلى الله عليه و سلم) and made for them wives and offspring. And it was not for a Messenger to bring a sign except by Allah's Leave. (For) every matter there is a Decree (from Allah). [Tafsir Al-Tabari]

source: يمحو الله ما يشاء ويثبت وعنده أم الكتاب
en: Allah blots out what He wills and confirms (what He wills). And with Him is the Mother of the Book (Al-Lauh Al-Mahfuz)

source: وإن ما نرينك بعض الذي نعدهم أو نتوفينك فإنما عليك البلاغ وعلينا الحساب
en: Whether We show you (O Muhammad صلى الله عليه و سلم) part of what We have promised them or cause you to die, your duty is only to convey (the Message) and on Us is the reckoning.

source: أولم يروا أنا نأتي الأرض ننقصها من أطرافها والله يحكم لا معقب لحكمه وهو سريع الحساب
en: See they not that We gradually reduce the land (of the disbelievers, by giving it to the believers, in war victories) from its outlying borders. And Allah judges, there is none to put back His Judgement and He is Swift at reckoning.

source: وقد مكر الذين من قبلهم فلله المكر جميعا يعلم ما تكسب كل نفس وسيعلم الكفار لمن عقبى الدار
en: And verily, those before them did devise plots, but all planning is Allah's. He knows what every person earns, and the disbelievers will know who gets the good end (final destination).

source: ويقول الذين كفروا لست مرسلا قل كفى بالله شهيدا بيني وبينكم ومن عنده علم الكتاب
en: And those who disbelieved, say: "You (O Muhammad صلى الله عليه و سلم) are not a Messenger." Say: "Sufficient as a witness between me and you is Allah and those too who have knowledge of the Scripture (such as 'Abdullah bin Salam and other Jews and Christians who embraced Islam)."

source: الر كتاب أنزلناه إليك لتخرج الناس من الظلمات إلى النور بإذن ربهم إلى صراط العزيز الحميد
en: Alif-Lam-Ra. [These letters are one of the miracles of the Qur'an, and none but Allah (Alone) knows their meanings]. (This is) a Book which We have revealed unto you (O Muhammad صلى الله عليه و سلم) in order that you might lead mankind out of darkness (of disbelief and polytheism) into light (of belief in the Oneness of Allah and Islamic Monotheism) by their Lord's Leave to the Path of the All-Mighty, the Owner of all Praise.

source: الله الذي له ما في السماوات وما في الأرض وويل للكافرين من عذاب شديد
en: Allah to Whom belongs all that is in the heavens and all that is in the earth! And woe unto the disbelievers from a severe torment.

source: الذين يستحبون الحياة الدنيا على الآخرة ويصدون عن سبيل الله ويبغونها عوجا أولئك في ضلال بعيد
en: Those who prefer the life of this world to the Hereafter, and hinder (men) from the Path of Allah (i.e. Islam) and seek crookedness therein - they are far astray.

source: وما أرسلنا من رسول إلا بلسان قومه ليبين لهم فيضل الله من يشاء ويهدي من يشاء وهو العزيز الحكيم
en: And We sent not a Messenger except with the language of his people, in order that he might make (the Message) clear for them. Then Allah misleads whom He wills and guides whom He wills. And He is the All-Mighty, the All-Wise.

source: ولقد أرسلنا موسى بآياتنا أن أخرج قومك من الظلمات إلى النور وذكرهم بأيام الله إن في ذلك لآيات لكل صبار شكور
en: And indeed We sent Musa (Moses) with Our Ayat (signs, proofs, and evidence) (saying): "Bring out your people from darkness into light, and remind them of the Annals of Allah. Truly, therein are Ayat (evidence, proofs and signs) for every patient, thankful (person)."

source: وإذ قال موسى لقومه اذكروا نعمة الله عليكم إذ أنجاكم من آل فرعون يسومونكم سوء العذاب ويذبحون أبناءكم ويستحيون نساءكم وفي ذلكم بلاء من ربكم عظيم
en: And (remember) when Musa (Moses) said to his people: "Call to mind Allah's Favour to you, when He delivered you from Fir'aun's (Pharaoh) people who were afflicting you with horrible torment, and were slaughtering your sons and letting your women alive; and in it was a tremendous trial from your Lord."

source: وإذ تأذن ربكم لئن شكرتم لأزيدنكم ولئن كفرتم إن عذابي لشديد
en: And (remember) when your Lord proclaimed: "If you give thanks (by accepting Faith and worshipping none but Allah), I will give you more (of My Blessings); but if you are thankless (i.e. disbelievers), verily My punishment is indeed severe."

source: وقال موسى إن تكفروا أنتم ومن في الأرض جميعا فإن الله لغني حميد
en: And Musa (Moses) said: "If you disbelieve, you and all on earth together, then verily Allah is Rich (Free of all needs), Owner of all Praise."

source: ألم يأتكم نبأ الذين من قبلكم قوم نوح وعاد وثمود والذين من بعدهم لا يعلمهم إلا الله جاءتهم رسلهم بالبينات فردوا أيديهم في أفواههم وقالوا إنا كفرنا بما أرسلتم به وإنا لفي شك مما تدعوننا إليه مريب
en: Has not the news reached you, of those before you, the people of Nuh (Noah), and 'Ad, and Thamud? And those after them? None knows them but Allah. To them came their Messengers with clear proofs, but they put their hands in their mouths (biting them from anger) and said: "Verily, we disbelieve in that with which you have been sent, and we are really in grave doubt as to that to which you invite us (i.e. Islamic Monotheism)."

source: قالت رسلهم أفي الله شك فاطر السماوات والأرض يدعوكم ليغفر لكم من ذنوبكم ويؤخركم إلى أجل مسمى قالوا إن أنتم إلا بشر مثلنا تريدون أن تصدونا عما كان يعبد آباؤنا فأتونا بسلطان مبين
en: Their Messengers said: "What! Can there be a doubt about Allah, the Creator of the heavens and the earth? He calls you (to Monotheism and to be obedient to Allah) that He may forgive you of your sins and give you respite for a term appointed." They said: "You are no more than human beings like us! You wish to turn us away from what our fathers used to worship. Then bring us a clear authority (i.e. a clear proof of what you say)."

source: قالت لهم رسلهم إن نحن إلا بشر مثلكم ولكن الله يمن على من يشاء من عباده وما كان لنا أن نأتيكم بسلطان إلا بإذن الله وعلى الله فليتوكل المؤمنون
en: Their Messengers said to them: "We are no more than human beings like you, but Allah bestows His Grace to whom He wills of His slaves. It is not ours to bring you an authority (proof) except by the Permission of Allah. And in Allah (Alone) let the believers put their trust.

source: وما لنا ألا نتوكل على الله وقد هدانا سبلنا ولنصبرن على ما آذيتمونا وعلى الله فليتوكل المتوكلون
en: "And why should we not put our trust in Allah while He indeed has guided us our ways? And we shall certainly bear with patience all the hurt you may cause us, and in Allah (Alone) let those who trust, put their trust."

source: وقال الذين كفروا لرسلهم لنخرجنكم من أرضنا أو لتعودن في ملتنا فأوحى إليهم ربهم لنهلكن الظالمين
en: And those who disbelieved, said to their Messengers: "Surely, we shall drive you out of our land, or you shall return to our religion." So their Lord revealed to them: "Truly, We shall destroy the Zalimun (polytheists, disbelievers and wrong-doers).

source: ولنسكننكم الأرض من بعدهم ذلك لمن خاف مقامي وخاف وعيد
en: "And indeed, We shall make you dwell in the land after them. This is for him who fears standing before Me (on the Day of Resurrection or fears My punishment) and also fears My threat."

source: واستفتحوا وخاب كل جبار عنيد
en: And they (the Messengers) sought victory and help [from their Lord (Allah)]; and every obstinate, arrogant dictator (who refuses to believe in the Oneness of Allah) was brought to a complete loss and destruction.

source: من ورائه جهنم ويسقى من ماء صديد
en: In front of him (every obstinate, arrogant dictator) is Hell, and he will be made to drink boiling, festering water.

source: يتجرعه ولا يكاد يسيغه ويأتيه الموت من كل مكان وما هو بميت ومن ورائه عذاب غليظ
en: He will sip it unwillingly, and he will find a great difficulty to swallow it down his throat ; and death will come to him from every side, yet he will not die and in front of him, will be a great torment.

source: مثل الذين كفروا بربهم أعمالهم كرماد اشتدت به الريح في يوم عاصف لا يقدرون مما كسبوا على شيء ذلك هو الضلال البعيد
en: The parable of those who disbelieved in their Lord is that their works are as ashes, on which the wind blows furiously on a stormy day; they shall not be able to get aught of what they have earned. That is the straying, far away (from the Right Path).

source: ألم تر أن الله خلق السماوات والأرض بالحق إن يشأ يذهبكم ويأت بخلق جديد
en: Do you not see that Allah has created the heavens and the earth with truth? If He wills, He can remove you and bring (in your place) a new creation!

source: وما ذلك على الله بعزيز
en: And for Allah that is not hard or difficult.

source: وبرزوا لله جميعا فقال الضعفاء للذين استكبروا إنا كنا لكم تبعا فهل أنتم مغنون عنا من عذاب الله من شيء قالوا لو هدانا الله لهديناكم سواء علينا أجزعنا أم صبرنا ما لنا من محيص
en: And they all shall appear before Allah (on the Day of Resurrection); then the weak will say to those who were arrogant (chiefs): "Verily, we were following you; can you avail us anything against Allah's Torment?" They will say: "Had Allah guided us, we would have guided you. It makes no difference to us (now) whether we rage, or bear (these torments) with patience; there is no place of refuge for us."

source: وقال الشيطان لما قضي الأمر إن الله وعدكم وعد الحق ووعدتكم فأخلفتكم وما كان لي عليكم من سلطان إلا أن دعوتكم فاستجبتم لي فلا تلوموني ولوموا أنفسكم ما أنا بمصرخكم وما أنتم بمصرخي إني كفرت بما أشركتمون من قبل إن الظالمين لهم عذاب أليم
en: And Shaitan (Satan) will say when the matter has been decided: "Verily, Allah promised you a promise of truth. And I too promised you, but I betrayed you. I had no authority over you except that I called you, and you responded to me. So blame me not, but blame yourselves. I cannot help you, nor can you help me. I deny your former act in associating me (Satan) as a partner with Allah (by obeying me in the life of the world). Verily, there is a painful torment for the Zalimun (polytheists and wrong-doers)."

source: وأدخل الذين آمنوا وعملوا الصالحات جنات تجري من تحتها الأنهار خالدين فيها بإذن ربهم تحيتهم فيها سلام
en: And those who believed (in the Oneness of Allah and His Messengers and whatever they brought) and did righteous deeds, will be made to enter Gardens under which rivers flow, - to dwell therein for ever (i.e. in Paradise), with the Permission of their Lord. Their greeting therein will be: Salam (peace!).

source: ألم تر كيف ضرب الله مثلا كلمة طيبة كشجرة طيبة أصلها ثابت وفرعها في السماء
en: See you not how Allah sets forth a parable? A goodly word as a goodly tree, whose root is firmly fixed, and its branches (reach) to the sky (i.e. very high).

source: تؤتي أكلها كل حين بإذن ربها ويضرب الله الأمثال للناس لعلهم يتذكرون
en: Giving its fruit at all times, by the Leave of its Lord, and Allah sets forth parables for mankind in order that they may remember.

source: ومثل كلمة خبيثة كشجرة خبيثة اجتثت من فوق الأرض ما لها من قرار
en: And the parable of an evil word is that of an evil tree uprooted from the surface of earth, having no stability.

source: يثبت الله الذين آمنوا بالقول الثابت في الحياة الدنيا وفي الآخرة ويضل الله الظالمين ويفعل الله ما يشاء
en: Allah will keep firm those who believe, with the word that stands firm in this world (i.e. they will keep on worshipping Allah Alone and none else), and in the Hereafter. And Allah will cause to go astray those who are Zalimun (polytheists and wrong-doers), and Allah does what He wills.

source: ألم تر إلى الذين بدلوا نعمت الله كفرا وأحلوا قومهم دار البوار
en: Have you not seen those who have changed the Blessings of Allah into disbelief (by denying Prophet Muhammad صلى الله عليه و سلم and his Message of Islam), and caused their people to dwell in the house of destruction?

source: جهنم يصلونها وبئس القرار
en: Hell, in which they will burn, - and what an evil place to settle in!

source: وجعلوا لله أندادا ليضلوا عن سبيله قل تمتعوا فإن مصيركم إلى النار
en: And they set up rivals to Allah, to mislead (men) from His Path! Say: "Enjoy (your brief life)! But certainly, your destination is the (Hell) Fire!"

source: قل لعبادي الذين آمنوا يقيموا الصلاة وينفقوا مما رزقناهم سرا وعلانية من قبل أن يأتي يوم لا بيع فيه ولا خلال
en: Say (O Muhammad صلى الله عليه و سلم) to 'Ibadi (My slaves) who have believed, that they should perform As-Salat (Iqamat-as-Salat ), and spend in charity out of the sustenance We have given them, secretly and openly, before the coming of a Day on which there will be neither mutual bargaining nor befriending.

source: الله الذي خلق السماوات والأرض وأنزل من السماء ماء فأخرج به من الثمرات رزقا لكم وسخر لكم الفلك لتجري في البحر بأمره وسخر لكم الأنهار
en: Allah is He Who has created the heavens and the earth and sends down water (rain) from the sky, and thereby brought forth fruits as provision for you; and He has made the ships to be of service to you, that they may sail through the sea by His Command; and He has made rivers (also) to be of service to you.

source: وسخر لكم الشمس والقمر دائبين وسخر لكم الليل والنهار
en: And He has made the sun and the moon, both constantly pursuing their courses, to be of service to you; and He has made the night and the day, to be of service to you.

source: وآتاكم من كل ما سألتموه وإن تعدوا نعمت الله لا تحصوها إن الإنسان لظلوم كفار
en: And He gave you of all that you asked for, and if you count the Blessings of Allah, never will you be able to count them. Verily, man is indeed an extreme wrong-doer, a disbeliever (an extreme ingrate who denies Allah's Blessings by disbelief, and by worshipping others besides Allah, and by disobeying Allah and His Prophet Muhammad صلى الله عليه و سلم).

source: وإذ قال إبراهيم رب اجعل هذا البلد آمنا واجنبني وبني أن نعبد الأصنام
en: And (remember) when Ibrahim (Abraham) said: "O my Lord! Make this city (Makkah) one of peace and security, and keep me and my sons away from worshipping idols.

source: رب إنهن أضللن كثيرا من الناس فمن تبعني فإنه مني ومن عصاني فإنك غفور رحيم
en: "O my Lord! They have indeed led astray many among mankind. But whoso follows me, he verily is of me. And whoso disobeys me, still You are indeed Oft-Forgiving, Most Merciful.

source: ربنا إني أسكنت من ذريتي بواد غير ذي زرع عند بيتك المحرم ربنا ليقيموا الصلاة فاجعل أفئدة من الناس تهوي إليهم وارزقهم من الثمرات لعلهم يشكرون
en: "O our Lord! I have made some of my offspring to dwell in an uncultivable valley by Your Sacred House (the Ka'bah at Makkah) in order, O our Lord, that they may perform As-Salat (Iqamat-as-Salat). So fill some hearts among men with love towards them, and (O Allah) provide them with fruits so that they may give thanks.

source: ربنا إنك تعلم ما نخفي وما نعلن وما يخفى على الله من شيء في الأرض ولا في السماء
en: "O our Lord! Certainly, You know what we conceal and what we reveal. Nothing on the earth or in the heaven is hidden from Allah.

source: الحمد لله الذي وهب لي على الكبر إسماعيل وإسحاق إن ربي لسميع الدعاء
en: "All the praises and thanks be to Allah, Who has given me in old age Isma'il (Ishmael) and Ishaq (Isaac). Verily! My Lord is indeed the All-Hearer of invocations.

source: رب اجعلني مقيم الصلاة ومن ذريتي ربنا وتقبل دعاء
en: "O my Lord! Make me one who performs As-Salat (Iqamat-as-Salat ), and (also) from my offspring, our Lord! And accept my invocation.

source: ربنا اغفر لي ولوالدي وللمؤمنين يوم يقوم الحساب
en: "Our Lord! Forgive me and my parents, and (all) the believers on the Day when the reckoning will be established."

source: ولا تحسبن الله غافلا عما يعمل الظالمون إنما يؤخرهم ليوم تشخص فيه الأبصار
en: Consider not that Allah is unaware of that which the Zalimun (polytheists, wrong-doers) do, but He gives them respite up to a Day when the eyes will stare in horror.

source: مهطعين مقنعي رءوسهم لا يرتد إليهم طرفهم وأفئدتهم هواء
en: (They will be) hastening forward with necks outstretched, their heads raised up (towards the sky), their gaze returning not towards them and their hearts empty (from thinking because of extreme fear).

source: وأنذر الناس يوم يأتيهم العذاب فيقول الذين ظلموا ربنا أخرنا إلى أجل قريب نجب دعوتك ونتبع الرسل أولم تكونوا أقسمتم من قبل ما لكم من زوال
en: And warn (O Muhammad صلى الله عليه و سلم) mankind of the Day when the torment will come unto them; then the wrong-doers will say: "Our Lord! Respite us for a little while, we will answer Your Call and follow the Messengers!" (It will be said): "Had you not sworn aforetime that you would not leave (the world for the Hereafter).

source: وسكنتم في مساكن الذين ظلموا أنفسهم وتبين لكم كيف فعلنا بهم وضربنا لكم الأمثال
en: "And you dwelt in the dwellings of men who wronged themselves, and it was clear to you how We had dealt with them. And We put forth (many) parables for you."

source: وقد مكروا مكرهم وعند الله مكرهم وإن كان مكرهم لتزول منه الجبال
en: Indeed, they planned their plot, and their plot was with Allah, though their plot was not such as to remove the mountains (real mountains or the Islamic law) from their places (as it is of no importance)[Tafsir Ibn Kathir] .

source: فلا تحسبن الله مخلف وعده رسله إن الله عزيز ذو انتقام
en: So think not that Allah will fail to keep His Promise to His Messengers. Certainly, Allah is All-Mighty, All-Able of Retribution.

source: يوم تبدل الأرض غير الأرض والسماوات وبرزوا لله الواحد القهار
en: On the Day when the earth will be changed to another earth and so will be the heavens, and they (all creatures) will appear before Allah, the One, the Irresistible.

source: وترى المجرمين يومئذ مقرنين في الأصفاد
en: And you will see the Mujrimun (criminals, disbelievers in the Oneness of Allah - Islamic Monotheism, polytheists) that Day Muqarranun (bound together) in fetters.

source: سرابيلهم من قطران وتغشى وجوههم النار
en: Their garments will be of pitch, and fire will cover their faces.

source: ليجزي الله كل نفس ما كسبت إن الله سريع الحساب
en: That Allah may requite each person according to what he has earned. Truly, Allah is Swift at reckoning.

source: هذا بلاغ للناس ولينذروا به وليعلموا أنما هو إله واحد وليذكر أولو الألباب
en: This (Qur'an) is a Message for mankind (and a clear proof against them), in order that they may be warned thereby, and that they may know that He is the only One Ilah (God - Allah) - (none has the right to be worshipped but Allah) - and that men of understanding may take heed.

source: الر تلك آيات الكتاب وقرآن مبين
en: Alif-Lam-Ra. [These letters are one of the miracles of the Qur'an, and none but Allah (Alone) knows their meanings].These are Verses of the Book and a plain Qur'an.

source: ربما يود الذين كفروا لو كانوا مسلمين
en: How much would those who disbelieved wish that they had been Muslims [those who have submitted themselves to Allah's Will in Islam i.e. Islamic Monotheism - this will be on the Day of Resurrection when they will see the disbelievers going to Hell and the Muslims going to Paradise].

source: ذرهم يأكلوا ويتمتعوا ويلههم الأمل فسوف يعلمون
en: Leave them to eat and enjoy, and let them be preoccupied with (false) hope. They will come to know!

source: وما أهلكنا من قرية إلا ولها كتاب معلوم
en: And never did We destroy a township but there was a known decree for it.

source: ما تسبق من أمة أجلها وما يستأخرون
en: No nation can advance its term, nor delay it.

source: وقالوا يا أيها الذي نزل عليه الذكر إنك لمجنون
en: And they say: "O you (Muhammad صلى الله عليه و سلم) to whom the Dhikr (the Qur'an) has been sent down! Verily, you are a mad man!

source: لو ما تأتينا بالملائكة إن كنت من الصادقين
en: "Why do you not bring angels to us if you are of the truthful?"

source: ما ننزل الملائكة إلا بالحق وما كانوا إذا منظرين
en: We send not the angels down except with the truth (i.e. for torment), and in that case, they (the disbelievers) would have no respite!

source: إنا نحن نزلنا الذكر وإنا له لحافظون
en: Verily, We, it is We Who have sent down the Dhikr (i.e. the Qur'an) and surely, We will guard it (from corruption) .

source: ولقد أرسلنا من قبلك في شيع الأولين
en: Indeed, We sent (Messengers) before you (O Muhammad صلى الله عليه و سلم) amongst the sects (communities) of old.

source: وما يأتيهم من رسول إلا كانوا به يستهزئون
en: And never came a Messenger to them but they did mock at him.

source: كذلك نسلكه في قلوب المجرمين
en: Thus do We let it (polytheism and disbelief) enter the hearts of the Mujrimun [criminals, polytheists and pagans (because of their mocking at the Messengers)].

source: لا يؤمنون به وقد خلت سنة الأولين
en: They would not believe in it (the Qur'an); and already the example of (Allah's punishment of) the ancients (who disbelieved) has gone forth.

source: ولو فتحنا عليهم بابا من السماء فظلوا فيه يعرجون
en: And even if We opened to them a gate from the heaven and they were to keep on ascending thereto (all the day long)

source: لقالوا إنما سكرت أبصارنا بل نحن قوم مسحورون
en: They would surely say (in the evening): "Our eyes have been (as if) dazzled (we have not seen any angel or heaven). Nay, we are a people bewitched."

source: ولقد جعلنا في السماء بروجا وزيناها للناظرين
en: And indeed, We have put the big stars in the heaven and We beautified it for the beholders.

source: وحفظناها من كل شيطان رجيم
en: And We have guarded it (near heaven) from every outcast Shaitan (devil).

source: إلا من استرق السمع فأتبعه شهاب مبين
en: Except him (devil) who steals the hearing then he is pursued by a clear flaming fire.
